package com.company;

/**
 * Написать программу, которая выведет на консоль «Hello world», не используя в исходном коде пробельных символов.
 */

public class Task04 {
    public static void main(String[] args) {
        System.out.print("Hello ");
        System.out.print("world");
    }
}
